package ru.geekbrains.DZ;

import java.util.Random;
import java.util.Scanner;

// Написать программу, которая загадывает случайное число от 0 до 9 и пользователю дается 3 попытки угадать это число.
// При каждой попытке компьютер должен сообщить, больше ли указанное пользователем число, чем загаданное, или меньше.
// После победы или проигрыша выводится запрос – «Повторить игру еще раз? 1 – да / 0 – нет»(1 – повторить, 0 – нет).

public class game {
    public static Scanner sc = new Scanner(System.in);

    public static int getNumberFromScanner(String message, int min, int max) { //метод запроса ввода целого числа в заданных пределах
        int x;
        do {
            System.out.println(message);
            x = sc.nextInt();
        } while (x < min || x > max);
        return x;
    }

    public static void oneMoreGame() { //метод запроса повтора игры
        int x;
        int userA = getNumberFromScanner("Повторить игру еще раз? 1 – да / 0 – нет", 0, 1);
        if (userA == 1) gameNumber();
    }

    public static int getRandomNumber(int maxN){ //метод создания случайного числа
        Random rnd = new Random();
        int rndInt = rnd.nextInt(maxN);
        return rndInt;
    }

    public static void gameNumber(){ //метод игры
        System.out.println("Добро пожаловать в игру УГАДАЙ ЧИСЛО!");
        int tryCount = 0; // переменная для подсчёта количества попыток
        int maxTry = 3;   // максимальное количество попыток
        int answer = getRandomNumber(10); //загаданное число
        do {
            int userAnswer = getNumberFromScanner("Введите число в пределах от 0 до 9", 0, 9);
            if (userAnswer == answer) {
                System.out.println("Поздравляю! Вы угадали!");
                break;
            }else {
   //             String securityAnswer = (userAnswer > answer) ? "Вы ввели слишком большое число!" : "Вы ввели слишком маленькое число!";
 //               System.out.println(securityAnswer);
                System.out.println((userAnswer > answer) ? "Вы ввели слишком большое число!" : "Вы ввели слишком маленькое число!");
                tryCount++;
                if (maxTry == tryCount) {
                    System.out.println("Вы проиграли!");
                    break;
                }
                System.out.println("Количество оставшихся попыток: " + (maxTry - tryCount));
            }
        }while (tryCount < maxTry);
        oneMoreGame(); // вызываем метод запроса на повтор игры
    }

    public static void main(String[] args) {
        gameNumber();
        sc.close(); //закрываем сканер
    }
}
